spool c:\uvol1088.sql;
set serveroutput on
set feedback off
set verify off
set pages 0
set lines 2000
set trims on
set longchunksize 20000
set heading off 
select 'exec ok_service.DISMISS_COLLEAGUE('''||branch||''','||personal_code||',to_date(''31.08.2011'',''dd.mm.yyyy''),''1'',''3'',''292/п'',to_date(''28.08.2011'',''dd.mm.yyyy''),0,''Адрес офиса'',''01'',''Уз хохишига кура'');'
from ok_personal where branch='01088'  and tabno in
(3, 19, 21, 40, 45, 59, 60, 61, 62, 66, 69, 80, 81, 102, 119, 121, 133, 150, 160, 167, 168, 170, 193, 213, 214, 218, 226, 232, 251, 254, 259, 262, 265, 276, 298, 300, 301, 319, 343, 355, 362, 374, 382, 384, 386, 401, 404, 413, 417, 422, 439, 472, 505, 511, 514, 540, 542, 554, 555, 558, 571, 572, 584, 591, 594, 598, 603, 608, 613, 617, 635, 643, 664, 668, 671, 685, 697, 712, 726, 728, 731, 732, 758, 764, 775, 781, 784, 811, 815, 821, 831, 833, 836, 839, 843, 851, 853, 1089, 1222, 1223, 1224, 1238, 1240, 1241, 1243, 1250, 1254, 1265, 1266, 1267, 1270, 1278, 1281, 1282, 1283, 1290, 1292, 1294, 1298, 1300, 615, 640, 258, 123, 576, 146, 5, 700, 252, 263, 336, 366, 641, 331, 1213, 320);
set feedback on
set verify on
set pages 1
set lines 2000
set trims on
set longchunksize 20000
set heading on

spool off;